       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITHOPS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A PIC 9(03) VALUE 10.
       01 WS-B PIC 9(03) VALUE 20.
       01 WS-C PIC 9(03) VALUE 30.
       01 WS-D PIC 9(03) VALUE 40.
       01 WS-RESULT PIC 9(05).
       PROCEDURE DIVISION.
       0000-MAIN.
           ADD WS-A TO WS-B.
           SUBTRACT WS-A FROM WS-C.
           MULTIPLY WS-A BY WS-B.
           DIVIDE WS-A INTO WS-D.
           COMPUTE WS-RESULT = WS-A + WS-B.
           STOP RUN.
       END PROGRAM ARITHOPS.
