       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIGITLEAD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DUMMY PIC X(01).
       PROCEDURE DIVISION.
       1000-MAIN.
           PERFORM 2000-READ-FILE.
           PERFORM 2000-READ-FILE THRU 2100-PROCESS.
           GO TO 9000-EXIT.
       2000-READ-FILE.
           MOVE 'R' TO WS-DUMMY.
       2100-PROCESS.
           MOVE 'P' TO WS-DUMMY.
       9000-EXIT.
           STOP RUN.
       END PROGRAM DIGITLEAD.
