       IDENTIFICATION DIVISION.
       PROGRAM-ID. OFFSETPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FLAG PIC X(01).
       PROCEDURE DIVISION.
           MOVE 'X' TO WS-FLAG.
           STOP RUN.
       END PROGRAM OFFSETPGM.
