>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. FREEFMT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME PIC X(20).
PROCEDURE DIVISION.
   DISPLAY "hello".
   STOP RUN.
END PROGRAM FREEFMT.
