       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVESUBS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME PIC X(50).
       01 WS-CUSTOMER PIC X(50).
       01 CUSTOMER-NAME PIC X(50).
       01 CUSTOMER-TABLE PIC X(100).
       01 CUSTOMER-TABLE-IDX PIC 9(03).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE CUSTOMER-NAME(1:10) TO WS-NAME.
           MOVE CUSTOMER-TABLE(CUSTOMER-TABLE-IDX) TO WS-CUSTOMER.
           MOVE CUSTOMER-TABLE(CUSTOMER-TABLE-IDX)(1:5) TO WS-NAME.
           STOP RUN.
       END PROGRAM MOVESUBS.
